{
    "c": {
        "phy114_114l": {
            "short": "'PHY 114/114L'",
            "long": "'PHY 114/114L Modern Astronomy & Laboratory'",
            "desc": "Introduces the objects and phenomena found in the universe, including the solar system, planets, moons, comets, meteors, the sun, stars, birth and death of stars, neutron stars, pulsars, black holes, galaxies, quasars, and cosmological evolution. Laboratory activities required. Lab is P/NP basis only. This course satisfies the general education laboratory science requirement. Prerequisite: competence in algebra.",
            "namelink": "",
            "namelinklong": ""
        },
        "phl105a": {
            "short": "'PHL 105'",
            "long": "'PHL 105 Introduction to Philosophy: Minds, Knowledge, and Value (WE)'",
            "desc": "Examines what philosophers think about some of the most basic questions in life. What is real? What does it mean to have a mind? Could minds have an existence independent from our bodies? Is there anything we can know with absolute certainty? Are there objective moral values, and if so, could we know what they are? May not be taken more than once for credit.",
            "namelink": "",
            "namelinklong": ""
        },
        "phl105b": {
            "short": "'PHL 105'",
            "long": "'PHL 105 Introduction to Philosophy: God, Self, and Free Will (WE)'",
            "desc": "Focuses on questions about the nature and existence of God, human nature, personhood, and free will. Is there evidence for the existence of God and is the presence of suffering in the world consistent with God’s existence? Are human beings merely material beings or might we have non-physical minds or souls? What are persons and what constitutes personal identity over time? What does it mean to have free will? Do we possess free will? May not be taken more than once for credit.",
            "namelink": "",
            "namelinklong": ""
        },
        "phl105c": {
            "short": "'PHL 105'",
            "long": "'PHL 105 Introduction to Philosophy: Masterworks (WE)'",
            "desc": "Central philosophical debates encountered through the examination of important classical and modern texts from the history philosophy. Readings in the course focus on several major works from philosophers such as Plato, Descartes, Hume, Marx, and Sartre who discuss the meaning of life, belief in God, the mind-body problem, relativism of truth, and other important philosophical concerns. May not be taken more than once for credit.",
            "namelink": "",
            "namelinklong": ""
        },  
        "phl105d": {
            "short": "'PHL 105'",
            "long": "'PHL 105 Introduction to Philosophy: Science Fiction and Philosophy (WE)'",
            "desc": "Uses science fiction as a springboard for thinking about classic issues and problems in philosophy. Sci-fi classics such as The Matrix, Bladerunner, and Surrogates, raise fundamental philosophical questions such as: What is the difference between appearance and reality and how can we distinguish between them? What is it to be a person? Should we think that all and only human beings can be persons? What is a good human life? Is a pleasant life sufficient for living a good life? In this course, such questions are examined through the lens of both philosophy and science fiction. May not be taken more than once for credit. ",
            "namelink": "",
            "namelinklong": ""
        },  
        "aam_eng137": {
            "short": "'AAM/ENG 137'",
            "long": "'AAM/ENG 137 African American Literature (WE) '",
            "desc": "Reading and discussion of the writings of African Americans, with emphasis on the 20th century. May include some relevant writings on African Americans by other groups. Study of the artistic values and of the social and cultural significance of these writings. May be taken more than once, with consent of African American Studies administrative coordinator, provided the topics are substantially different.",
            "namelink": "",
            "namelinklong": ""
        },  
        "aam447_457": {
            "short": "'AAM 447/457'",
            "long": "'AAM 447/457 Directed Studies in African American Studies'",
            "desc": "Study of selected topics and primary texts not available within the regular offerings. Prerequisite: two courses in African American studies. Registration by consent of instructor, after submission of a written project proposal. Conferences with instructor and papers are required. May be taken more than once for credit with consent of African American Studies administrative coordinator. ",
            "namelink": "",
            "namelinklong": ""
        }, 
	"asc216": {
	    "short": "'ASC 216'", 
	    "long": "'ASC 216 History of Modern Korea (WE)'", 
	    "desc": "Introduces students to modern Korean history by examining Korea’s transition from a politically isolated rural state to, in the South, an industrialized country electing its own government and, in the North, a totalitarian state capable of producing nuclear weapons. Students will examine historical documents, literature and film and use class discussion and formal papers to analyze key events such as: Korea’s colonization under Japan; the Korean War; South Korea’s economic and democratic “miracles;” North Korean communism and nuclear brinksmanship; and South Korea’s emergence as a major producer of exported entertainment like K-Pop and K-Drama.", 
	    "namelink": "", 
	    "namelinklong": ""
	}, 
	"rel386":{
	    "short": "'REL 386'", 
	    "long": "'REL 386 Advanced Topics in Religion: Non-Western Perspectives (WE)'", 
	    "desc": "Same as Advanced Topics in Religion (REL-385) except the course focuses on topics related to non-Western cultures. Content varies from year to year. May be taken more than once for credit. Prerequisite: one course in religion or consent of instructor.'", 
	    "namelink": "", 
	    "namelinklong": ""
	},
	"evs137":{
	    "short": "'EVS 137'", 
	    "long": "'EVS 137 Environmental Law: The Wilderness Act and the Battle Over the Boundary Waters'", 
	    "desc": "An introduction to environmental law and the effort to control the effects of human activity on land and water. After an overview of basic environmental law covering property rights and wilderness protection, the class applies the same to the Boundary Waters Canoe Area Wilderness (BWCAW), local communities, recreation, and use of the area. Significant time is spent on the legislative efforts to establish the BWCAW and subsequent judicial interpretation of those laws. Multiple trips to areas of different preservation status are taken to help evaluate the practical effects of the disparate levels of protection. (Offered summers at the Wilderness Field Station)" ,
	    "namelink": "", 
	    "namelinklong": ""
	} 
	

    }
}
