{
    "c": {
        "phy114_114l": {
            "short": "'PHY 114/114L'",
            "long": "'PHY 114/114L Modern Astronomy & Laboratory'",
            "desc": "Introduces the objects and phenomena found in the universe, including the solar system, planets, moons, comets, meteors, the sun, stars, birth and death of stars, neutron stars, pulsars, black holes, galaxies, quasars, and cosmological evolution. Laboratory activities required. Lab is P/NP basis only. This course satisfies the general education laboratory science requirement. Prerequisite: competence in algebra.",
            "namelink": "",
            "namelinklong": ""
        },
        "phl105a": {
            "short": "'PHL 105'",
            "long": "'PHL 105 Introduction to Philosophy: Minds, Knowledge, and Value (WE)'",
            "desc": "Examines what philosophers think about some of the most basic questions in life. What is real? What does it mean to have a mind? Could minds have an existence independent from our bodies? Is there anything we can know with absolute certainty? Are there objective moral values, and if so, could we know what they are? May not be taken more than once for credit.",
            "namelink": "",
            "namelinklong": ""
        },
        "phl105b": {
            "short": "'PHL 105'",
            "long": "'PHL 105 Introduction to Philosophy: God, Self, and Free Will (WE)'",
            "desc": "Focuses on questions about the nature and existence of God, human nature, personhood, and free will. Is there evidence for the existence of God and is the presence of suffering in the world consistent with God’s existence? Are human beings merely material beings or might we have non-physical minds or souls? What are persons and what constitutes personal identity over time? What does it mean to have free will? Do we possess free will? May not be taken more than once for credit.",
            "namelink": "",
            "namelinklong": ""
        },
        "phl105c": {
            "short": "'PHL 105'",
            "long": "'PHL 105 Introduction to Philosophy: Masterworks (WE)'",
            "desc": "Central philosophical debates encountered through the examination of important classical and modern texts from the history philosophy. Readings in the course focus on several major works from philosophers such as Plato, Descartes, Hume, Marx, and Sartre who discuss the meaning of life, belief in God, the mind-body problem, relativism of truth, and other important philosophical concerns. May not be taken more than once for credit.",
            "namelink": "",
            "namelinklong": ""
        },  
        "phl105d": {
            "short": "'PHL 105'",
            "long": "'PHL 105 Introduction to Philosophy: Science Fiction and Philosophy (WE)'",
            "desc": "Uses science fiction as a springboard for thinking about classic issues and problems in philosophy. Sci-fi classics such as The Matrix, Bladerunner, and Surrogates, raise fundamental philosophical questions such as: What is the difference between appearance and reality and how can we distinguish between them? What is it to be a person? Should we think that all and only human beings can be persons? What is a good human life? Is a pleasant life sufficient for living a good life? In this course, such questions are examined through the lens of both philosophy and science fiction. May not be taken more than once for credit. ",
            "namelink": "",
            "namelinklong": ""
        },  
        "aam_eng137": {
            "short": "'AAM/ENG 137'",
            "long": "'AAM/ENG 137 African American Literature (WE) '",
            "desc": "Reading and discussion of the writings of African Americans, with emphasis on the 20th century. May include some relevant writings on African Americans by other groups. Study of the artistic values and of the social and cultural significance of these writings. May be taken more than once, with consent of African American Studies administrative coordinator, provided the topics are substantially different.",
            "namelink": "",
            "namelinklong": ""
        },  
        "aam447_457": {
            "short": "'AAM 447/457'",
            "long": "'AAM 447/457 Directed Studies in African American Studies'",
            "desc": "Study of selected topics and primary texts not available within the regular offerings. Prerequisite: two courses in African American studies. Registration by consent of instructor, after submission of a written project proposal. Conferences with instructor and papers are required. May be taken more than once for credit with consent of African American Studies administrative coordinator. ",
            "namelink": "",
            "namelinklong": ""
        }, 
	"asc216": {
	    "short": "'ASC 216'", 
	    "long": "'ASC 216 History of Modern Korea (WE)'", 
	    "desc": "Introduces students to modern Korean history by examining Korea’s transition from a politically isolated rural state to, in the South, an industrialized country electing its own government and, in the North, a totalitarian state capable of producing nuclear weapons. Students will examine historical documents, literature and film and use class discussion and formal papers to analyze key events such as: Korea’s colonization under Japan; the Korean War; South Korea’s economic and democratic “miracles;” North Korean communism and nuclear brinksmanship; and South Korea’s emergence as a major producer of exported entertainment like K-Pop and K-Drama.", 
	    "namelink": "", 
	    "namelinklong": ""
	}, 
	"rel386":{
	    "short": "'REL 386'", 
	    "long": "'REL 386 Advanced Topics in Religion: Non-Western Perspectives (WE)'", 
	    "desc": "Same as Advanced Topics in Religion (REL-385) except the course focuses on topics related to non-Western cultures. Content varies from year to year. May be taken more than once for credit. Prerequisite: one course in religion or consent of instructor.'", 
	    "namelink": "", 
	    "namelinklong": ""
	},
	"evs137":{
	    "short": "'EVS 137'", 
	    "long": "'EVS 137 Environmental Law: The Wilderness Act and the Battle Over the Boundary Waters'", 
	    "desc": "An introduction to environmental law and the effort to control the effects of human activity on land and water. After an overview of basic environmental law covering property rights and wilderness protection, the class applies the same to the Boundary Waters Canoe Area Wilderness (BWCAW), local communities, recreation, and use of the area. Significant time is spent on the legislative efforts to establish the BWCAW and subsequent judicial interpretation of those laws. Multiple trips to areas of different preservation status are taken to help evaluate the practical effects of the disparate levels of protection. (Offered summers at the Wilderness Field Station)" ,
	    "namelink": "", 
	    "namelinklong": ""
	}, 
	"chm103_103l":{
	    "short": "'CHM 103/103L'", 
	    "long": "'CHM 103/103L Selected Concepts in Chemistry and Laboratory'", 
	    "desc": "A consideration of the basic principles of chemistry and applications of chemistry in contemporary society. Three class meetings and one laboratory per week. This course does not satisfy any of the requirements for a major or minor in chemistry.", 
	    "namelink": "", 
	    "namelinklong": ""
	},
	"chm111_111l":{
	    "short": "'CHM 111/111L'", 
	    "long": "'CHM 111/111L Introduction to Organic and Biological Chemistry and Laboratory'", 
	    "desc": "Designed as a course for pre-nursing student. Topics in introductory organic and biological chemistry include drugs, proteins, and DNA. Laboratory component involves basic experimental techniques in organic chemistry and biochemistry. Three class meetings and one laboratory per week. Lab is P/NP basis only. This course does not satisfy any of the requirements for a major or minor in chemistry. Prerequisites: Cellular and Molecular Biology (BIO145) and one year of secondary school chemistry or one term of college chemistry, or consent of instructor.", 
	    "namelink": "", 
	    "namelinklong": ""
	}, 
	"chm121_121l":{
	    "short": "'CHM 121/121L'", 
	    "long": "'CHM 121/121L General Chemistry I and Laboratory'", 
	    "desc": "A foundational treatment of atoms and molecules. Explores the nature of chemical bonding and how the macroscopic properties of substances can be interpreted in terms of atomic and molecular structure. Laboratory work emphasizes experimental techniques and the acquisition and analysis of experimental data. Three class meetings and one three-hour laboratory per week. Lab is P/NP basis only. Prerequisite: secondary school chemistry or consent of instructor.", 
	    "namelink": "", 
	    "namelinklong": ""
	}, 
	"chm122_122l":{
	    "short": "'CHM 122/122L'", 
	    "long": "'CHM 122/122L General Chemistry II and Laboratory'", 
	    "desc": "A continuation of CHM-101. Topics include chemical kinetics, thermodynamics, equilibria, and redox chemistry. Three class meetings and one three-hour laboratory period per week. Lab is P/NP basis only. Prerequisite: General Chemistry I and Laboratory (CHM-121/-121L) or consent of instructor.", 
	    "namelink": "", 
	    "namelinklong": ""
	}, 
	"chm341_341l":{
	    "short": "'CHM 341/341L'", 
	    "long": "'CHM 341/341L Physical Chemistry I (WE) and Laboratory'", 
	    "desc": "Study of chemical systems from a molecular basis. Basic concepts of kinetic molecular theory, quantum mechanics and thermodynamics applied to molecular structure and chemical change. Fundamentals of electronic structure of atoms and molecules and interaction of matter with light. Three class meetings and one three-hour, (0.0 course credit) laboratory per week. Prerequisites: General Chemistry II & Laboratory (CHM-122/-122L), General Physics I & Laboratory (PHY-185/-185L), and Calculus II (MTH-145).", 
	    "namelink": "", 
	    "namelinklong": ""
	}, 
	"chm431_431l":{
	    "short": "'CHM 431/431L'", 
	    "long": "'CHM 431/431L Biochemistry and Laboratory'", 
	    "desc": "Introduces biochemical processes, emphasizing biological oxidation and reduction; the chemistry of carbohydrates, lipids, proteins, and nucleotides; and the theory and mechanism of enzyme reactions. Laboratory includes modern techniques for separation, purification, and analysis of biochemical systems and substances. Three class meetings and one laboratory per week. Prerequisites: Cellular and Molecular Biology (BIO-145) and Organic Chemistry II (CHM321).", 
	    "namelink": "", 
	    "namelinklong": ""
	}, 
	"chm464_474":{
	    "short": "'CHM 464/474'", 
	    "long": "'CHM 464/474 Seminar in Chemistry I, II'", 
	    "desc": "Weekly seminar covering two terms, in which topics of interest in modern chemistry and chemical research are presented. Particular emphasis on improving scientific communication skills. Required for all majors in chemistry. Prerequisites: Organic Chemistry I (CHM-221) and junior standing or consent of department chair. (Each seminar: 0.25 course credit)", 
	    "namelink": "", 
	    "namelinklong": ""
	}, 
	"chm211_211l":{
	    "short": "'CHM 211/211L'", 
	    "long": "'CHM 211/211L Analytical Chemistry and Laboratory (WE)'", 
	    "desc": "A study of the theory of equilibria as they apply to quantitative chemical analysis. The basic principles of spectroscopy, potentiometry, and chromatography are introduced. Three class meetings per week. Prerequisite: General Chemistry II and Laboratory (CHM-122/-122L). Corequisite: Analytical Chemistry Laboratory (CHM-211L).", 
	    "namelink": "", 
	    "namelinklong": ""
	}, 
	"chm432_432l":{
	    "short": "'CHM 432/432L'", 
	    "long": "'CHM 432/432L Protein Biochemistry and Laboratory'", 
	    "desc": "A study of the structure and function of proteins in their many biochemical roles. Topics include proteins as enzymes, messengers, antibodies, regulators, storage, structure, and transport molecules. Protein purification, protein engineering and kinetics, structure prediction, spectroscopy, and current literature topics are covered. Prerequisites: Cellular and Molecular Biology (BIO-145) and Organic Chemistry II (CHM-321). Corequisite: Protein Biochemistry Laboratory (CHM-432L). (Offered alternate years)", 
	    "namelink": "", 
	    "namelinklong": ""
	}, 
	"chm451_451l":{
	    "short": "'CHM 451/ 451L'", 
	    "long": "'CHM 451/ 451L Inorganic Chemistry and Laboratory (WE)'", 
	    "desc": "Structures and properties of selected ionic and covalent inorganic substances, coordination complexes and electron deficient compounds, general acid base theory, and inorganic reactions in solution. Prerequisite: Physical Chemistry I and Laboratory (CHM-341/-341L). (Offered alternate years)", 
	    "namelink": "", 
	    "namelinklong": ""
	}, 
	"grk284_384":{
	    "short": "'GRK 284/384'", 
	    "long": "'GRK 284/384 Topics in Greek'", 
	    "desc": "Close textual reading and analysis of major Greek writers in the koine or Classical tradition. Concern with stylistic differences, translating facility, and Greek culture. Combination of lecture, discussion, and translating. May be taken more than once for credit, provided the topics are substantially different. Prerequisite: Selected Readings in Ancient Greek (GRK-125) or four or more terms of secondary school Greek and consent of instructor. ", 
	    "namelink": "", 
	    "namelinklong": ""
	},
	"ltn284_384":{
	    "short": "'LTN 284/384'", 
	    "long": "'LTN 284/384 Topics in Latin'", 
	    "desc": "Close textual reading and analysis of major Roman writers. Concern with stylistic differences, translating facility, and Roman culture. Combination of lecture, discussion, and translating. Prerequisite: selected Readings in Latin (LTN125) or four or more terms of secondary school Latin and consent of instructor.", 
	    "namelink": "", 
	    "namelinklong": ""
	}, 
	"com435_437": {
	    "short": "'COM 435/437'", 
	    "long": "'COM 435/437 Special Topics in Relational Communication (WE)'", 
	    "desc": "Exploration of a topic within the field of relational communication. Course work includes a substantive research project, and oral presentations. May be taken more than once for credit with consent of department chair. Can satisfy the DCP requirement when topic is appropriate. Prerequisites: Rhetorical Theory and Practice (RHE-200) and either Research Methods in Communication Studies (COM-381) or Research Methods: Rhetorical/Critical (COM-382).",
	    "namelink": "", 
	    "namelinklong": ""
	}, 
	"com445_447":{
	    "short": "'COM 445/447'", 
	    "long": "'COM 445/447 Special Topics in Production (WE)'", 
	    "desc": "Exploration of a topic within the field of production. Course work includes a substantive research project, and oral presentations. May be taken more than once for credit with consent of department chair. Can satisfy the DCP requirement when topic is appropriate. Prerequisites: Rhetorical Theory and Practice (RHE-200) and either Research Methods in Communication Studies (COM-381) or Research Methods: Rhetorical/Critical (COM-382).", 
	    "namelink": "", 
	    "namelinklong": ""
	}, 
	"com455_457":{
	    "short": "'COM 455/457'", 
	    "long": "'COM 455/457 Special Topics in Media Studies (WE)'", 
	    "desc": "Exploration of a topic within the field of media studies. Course work includes a substantive research project, and oral presentations. May be taken more than once for credit with consent of department chair. Can satisfy the DCP requirement when topic is appropriate. Prerequisites: Rhetorical Theory and Practice (RHE-200) and either Research Methods in Communication Studies (COM-381) or Research Methods: Rhetorical/Critical (COM-382).", 
	    "namelink": "", 
	    "namelinklong": ""
	}, 
	"com465_467":{
	    "short": "'COM 465/467'", 
	    "long": "'COM 465/467 Special Topics in Public Discourse (WE)'", 
	    "desc": "Exploration of a topic within the field of public discourse. Course work includes a substantive research project, and oral presentations. May be taken more than once for credit with consent of department chair. Can satisfy the DCP requirement when topic is appropriate. Prerequisites: Rhetorical Theory and Practice (RHE-200) and either Research Methods in Communication Studies (COM-381) or Research Methods: Rhetorical/Critical (COM-382).",
	    "namelink": "", 
	    "namelinklong": ""
	}, 
	"aam_eng137":{
	    "short": "'AAM/ENG 137'",
	    "long": "'AAM/ENG 137 African American Literature (WE)'",
	    "desc": "Reading and discussion of the writings of African Americans, with emphasis on the 20th century. May include some relevant writings on African Americans by other groups. Study of the artistic values and of the social and cultural significance of these writings. May be taken more than once, with consent of African American Studies administrative coordinator, provided the topics are substantially different.", 
	    "namelink": "", 
	    "namelinklong": ""
	}, 
	"aam447_457":{
	    "short": "'AAM 447/457'", 
	    "long": "'AAM 447/457 Directed Studies in African American Studies'", 
	    "desc": "Study of selected topics and primary texts not available within the regular offerings. Prerequisite: two courses in African American studies. Registration by consent of instructor, after submission of a written project proposal. Conferences with instructor and papers are required. May be taken more than once for credit with consent of African American Studies administrative coordinator.", 
	    "namelink": "", 
	    "namelinklong": ""
	}, 
	 "bio215_215l":{
	    "short": "'BIO 215/215L'",
	    "long": "'BIO 215/215L Human Anatomy and Laboratory'", 
	    "desc": "Surveys microscopic and gross human anatomy, providing necessary background for students in physiology and body mechanics. Three lectures per week. Prerequisites: Cellular and Molecular Biology (BIO-145). This course does not satisfy any of the requirements for a major in biology. Credit is given for Human Anatomy (BIO-215) or Integrated Human Anatomy (BIO-315), not both.",
	    "namelink": "", 
	    "namelinklong": ""
	 }, 
	"nur345_345l":{
	    "short": "'NUR 345/345L'", 
	    "long": "'NUR 345/345L Mental Health Nursing and Laboratory'", 
	    "desc": "Focuses on the knowledge and skills necessary to provide safe, holistic care for diverse individuals and families experiencing actual or potential alterations in mental health. Students explore specific mental health problems and how to apply evidence-based practice when caring for individuals and families across the life span, as well as the importance of self-analysis, respect for diversity, professional accountability, and ethical responsibility. Students develop communication techniques necessary to promote client well-being and safety, as well as collaborate with the health-care team. Clinical application includes caring for individuals experiencing alterations in mental health in a variety of settings. Prerequisite: admission into the Bachelor of Science Nursing Program; Art and Science of Nursing (NUR-300), Information Literacy and Management (WE) (NUR-305), Pharmacological Principles (NUR-360), and Pathophysiology and Assessment (NUR-315/NUR-315L/NUR-315C).", 
	    "namelink": "", 
	    "namelinklong": ""
	}, 
	"nur315_315l":{
	    "short": "'NUR 315/315L'", 
	    "long": "'NUR 315/315L Pathophysiology and Assessment/Clinical Application'", 
	    "desc": "Provides the foundation for the integration of assessment data and pathophysiological concepts in the application of the nursing process. Focuses on comprehensive health assessment of diverse individuals across the lifespan. Assessment skills, health histories, and physical exams are practiced. Clinical and laboratory components provide opportunities to reinforce psychomotor skills and health assessment skills with diverse individuals across the lifespan as well as implementing safe, basic patient-centered care. Lab and clinical are P/NP basis only. Prerequisites: admission to the Bachelor of Science in Nursing Program; previous or concurrent registration in the following course: Art and Science of Nursing (NUR-300), Information Literacy and Management (WE) (NUR-305), Pharmacological Principles (NUR-360). (2.0 course credits)", 
	    "namelink": "", 
	    "namelinklong": ""
	}, 
	"nur355_355l":{
	    "short": "'NUR 355/355L'", 
	    "long": "'NUR 355/355L Introductory Concepts in Nursing/Clinical Application'",
	    "desc": "Focuses on holistic care of diverse individuals and families across the life span. Applies the nursing process, emphasizing primary, secondary, and tertiary nursing interventions. in the care of individuals experiencing actual or risk for alterations in renal, gastrointestinal, and musculoskeletal systems. Surgical, dietary, and pharmacological management is integrated. Clinical and laboratory components provide opportunities to reinforce psychomotor skills and application of the nursing process in the delivery of safe, evidence-based, holistic care. Lab and clinical are P/NP basis only. Prerequisites: admission into the Bachelor of Science Nursing Program; Art and Science of Nursing (NUR-300); Information Literacy and Management (WE) (NUR-305); Pharmacological Principles (NUR-360), and Pathophysiology and Assessment (NUR-315/NUR-315L/NUR-315C). (2.0 course credits)",
	    "namelink": "", 
	    "namelinklong": ""
	}
	"nur415_415l":{
	    "short": "'NUR 415/415L'", 
	    "long": "'NUR 415/415L Advanced Concepts in Nursing/Clinical Application'",
	    "desc": "Advances and continues the focus of holistic care for diverse individuals, families, groups, and populations across the life span. Applies the nursing process, emphasizing primary, secondary and tertiary nursing interventions, in care of individuals experiencing actual or risk for alterations in integumentary, pulmonary, cardiovascular, endocrine, sensory/neurological, and immune systems. Surgical, dietary and pharmacological management is integrated. Clinical and laboratory components provide opportunities to reinforce psychomotor skills and application of the nursing process in the delivery of safe, evidence-based, holistic, patient-centered care. Lab and clinical are P/NP basis only. Prerequisite: admission into the Bachelor of Science Nursing Program; Mental Health Nursing (NUR-345), Legal & Ethical Issues in Nursing (WE) (NUR-375), Pharmacological Principles (NUR-360), Introductory Concepts in Nursing/Clinical Application (NUR-355/-355L/-355C). (2.0 course credits)",
	    "namelink": "", 
	    "namelinklong": ""
	}, 
	"nur455_455l":{
	    "short": "'NUR 455/455L'",
	    "long": "'NUR 455/455L Leadership and Contemporary Issues in Nursing/Clinical Application (WE)'",
	    "desc": "Focuses on leadership skills, knowledge, and creativity to promote and manage safe, holistic patient-centered care for diverse individuals, families, groups, and populations across the lifespan. Concepts include management and organizations, quality improvement, change process, political/organizational/micro systems, communication/collaboration, fiscal/ human resource management, delegation, prioritization, decision making, and professional/self-care management. Nursing theories/frameworks are discussed. Clinical components provide an opportunity to collaborate with patients, families, and health care team members and to develop leadership roles. Lab and clinical are P/NP basis only. Prerequisite: admission into the Bachelor of Science Nursing Program; Advanced Concepts in Nursing (NUR-415/-415L/-415C), Community and Population Oriented Nursing (NUR-430), and Nursing Research (WE) (NUR-425). (2.0 course credits)",
	    "namelink": "", 
	    "namelinklong": ""
	}, 
	"nur455_455c":{
	    "short": "'NUR 455/455C'", 
	    "long": "'NUR 455/455C Leadership and Contemporary Issues in Nursing (WE)'",
	    "desc": "Focuses on leadership skills, knowledge, and creativity to promote and manage safe, holistic patient-centered care for diverse individuals, families, groups, and populations across the lifespan. Concepts include management and organizations, quality improvement, change process, political/organizational/micro systems, communication/collaboration, fiscal/ human resource management, delegation, prioritization, decision making, and professional/self-care management. Nursing theories/frameworks are discussed. Clinical components provide an opportunity to collaborate with patients, families, and health care team members and to develop leadership roles. Lab and clinical are P/NP basis only. Prerequisite: admission into the Bachelor of Science Nursing Program; Advanced Concepts in Nursing (NUR-415/-415L/-415C), Community and Population Oriented Nursing (NUR-430), and Nursing Research (WE) (NUR-425). (2.0 course credits)",
	    "namelink": "", 
	    "namelinklong": ""
	}, 
	"nur315_315l_315c":{
	    "short": "'NUR 315/315L/315C'", 
	    "long": "'NUR 315/315L/315C Pathophysiology and Assessment'",
	    "desc": "Provides the foundation for the integration of assessment data and pathophysiological concepts in the application of the nursing process. Focuses on comprehensive health assessment of diverse individuals across the lifespan. Assessment skills, health histories, and physical exams are practiced. Clinical and laboratory components provide opportunities to reinforce psychomotor skills and health assessment skills with diverse individuals across the lifespan as well as implementing safe, basic patient-centered care. Lab and clinical are P/NP basis only. Prerequisites: admission to the Bachelor of Science in Nursing Program; previous or concurrent registration in the following course: Art and Science of Nursing (NUR-300), Information Literacy and Management (WE) (NUR-305), Pharmacological Principles (NUR-360). (2.0 course credits) ",
	    "namelink": "", 
	    "namelinklong": ""
	}, 
	"nur355_355l_355c":{
	    "short": "'NUR 355/355L/355C'", 
	    "long": "'NUR 355/355L/355C Introductory Concepts in Nursing'",
	    "desc": "Focuses on holistic care of diverse individuals and families across the life span. Applies the nursing process, emphasizing primary, secondary, and tertiary nursing interventions. in the care of individuals experiencing actual or risk for alterations in renal, gastrointestinal, and musculoskeletal systems. Surgical, dietary, and pharmacological management is integrated. Clinical and laboratory components provide opportunities to reinforce psychomotor skills and application of the nursing process in the delivery of safe, evidence-based, holistic care. Lab and clinical are P/NP basis only. Prerequisites: admission into the Bachelor of Science Nursing Program; Art and Science of Nursing (NUR-300); Information Literacy and Management (WE) (NUR-305); Pharmacological Principles (NUR-360), and Pathophysiology and Assessment (NUR-315/NUR-315L/NUR-315C). (2.0 course credits) ",
	    "namelink": "", 
	    "namelinklong": ""
	}, 
	"nur415_415l_415c": {
	    "short": "'NUR 415/415L/415C'",
	    "long": "'NUR 415/415L/415C Advanced Concepts in Nursing'",
	    "desc": "Advances and continues the focus of holistic care for diverse individuals, families, groups, and populations across the life span. Applies the nursing process, emphasizing primary, secondary and tertiary nursing interventions, in care of individuals experiencing actual or risk for alterations in integumentary, pulmonary, cardiovascular, endocrine, sensory/neurological, and immune systems. Surgical, dietary and pharmacological management is integrated. Clinical and laboratory components provide opportunities to reinforce psychomotor skills and application of the nursing process in the delivery of safe, evidence-based, holistic, patient-centered care. Lab and clinical are P/NP basis only. Prerequisite: admission into the Bachelor of Science Nursing Program; Mental Health Nursing (NUR-345), Legal & Ethical Issues in Nursing (WE) (NUR-375), Pharmacological Principles (NUR-360), Introductory Concepts in Nursing/Clinical Application (NUR-355/-355L/-355C). (2.0 course credits)", 
	    "namelink": "", 
	    "namelinklong": ""
	}
	
		
    }
}
